# StairstypeIntermediateSupportType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeIntermediateSupportType Property
ParameterTypeId Class See Also
---
"Middle Support Type": Intermediate Support Type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeIntermediateSupportType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeIntermediateSupportType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeIntermediateSupportType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace